[
  {
    "key": "resume",
    "heading": "Resume",
    "summary": "ISLT Portfolio Everett Stuckey | ISLT EdS Candidate Download the comprehensive CV detailing leadership, counseling, and instructional design experience.",
    "link": "https://everettstuckey.github.io/islt_7310/EverettStuckeyResume%20Data.pdf"
  },
  {
    "key": "program-of-study",
    "heading": "Program of Study",
    "summary": "The Program of Study for my ISLT degree includes the courses below. Each course lists the term, a concise description, and my reflection linking outcomes to practice and artifacts where applicable.",
    "link": "https://everettstuckey.github.io/islt_7310/portfolio.html#program-of-study"
  },
  {
    "key": "reflection-statement",
    "heading": "Reflection Statement",
    "summary": "When I entered the ISLT program, I brought a counselor’s mindset and a financier’s analytical discipline, but my technology practice was largely pragmatic. In daily school work, I made tools “work well enough” to meet immediate student needs , sharing resources, simplifying instructions, and troubleshooting access barriers. What I lacked was a systematic framework for designing technology-enhanced learning experiences end to end: aligning needs to outcomes, selecting tools intentionally, measuring impact, and then iterating for equity and clarity. I chose the ISLT program, Technology in Schools emphasis, to build that structure around my practice. I wanted to develop reusable patterns for accessible web design, rapid prototyping, and responsible use of learning data that could scale beyond individual interventions. Entering the program, I was comfortable with quantitative reasoning and stakeholder communication from my finance background and counseling experience, but I needed deeper knowledge in interaction design, evaluation, and standards-based technology integration. The ISLT coursework challenged me to move from ad hoc solutions to an evidence-driven, ethically grounded design approach, one that serves students and families across devices, bandwidth, and contexts while protecting their privacy and honoring their time.",
    "link": "https://everettstuckey.github.io/islt_7310/portfolio.html#reflection"
  },
  {
    "key": "learning-technologies-program-goals-and-student-learning-outcomes",
    "heading": "Learning Technologies Program Goals and Student Learning Outcomes",
    "summary": "The Learning Technologies (LTD) program prepares practitioners to systematically design, develop, evaluate, and lead learning technology and instructional solutions across educational and organizational contexts. The reflections below connect my artifacts to each outcome, demonstrating how theory and research informed my practice in equitable, accessible, and sustainable ways.",
    "link": "https://everettstuckey.github.io/islt_7310/portfolio.html#program-goals"
  }
]
